// 18. Вычислить 1 - 1/2 + 1/3 - 1/4 + ...+1/9999 - 1/10000 следующими способами:
// a). последовательно слева направо;
// b). последовательно справа налево;
#include <stdio.h>
int main(){
  double a=-1.0, sum=0.0;
  for (int i=1; i<=1000; i++)
    {
      a*=-1.0;
      sum+=a/i;
    }
printf("%f\n",sum);
  a=-1.0, sum=0.0;
  for (int i=1000; i>=1; i--)
    {
    a*=-1.0;
    sum+=a/i;
    }
printf("%f",sum);
}


c). последовательно слева направо вычисляются 1 +1/3 + 1/5 + ... + 1/9999 и 1/2 + 1/4 + ... + 1/10000, затем второе значение вычитается из первого;
#include <stdio.h>
int main()
{
  double t,r,sum,sum1;
  for (int i=1; i<=9999; i=i+2)
    {
      t=1/i;
      sum+=t;
    }
  for (int i=2; i<=10000; i=i+2)
    {
      r=1/i;
      sum1+=r; 
    }
printf("%f",sum1-sum);
}


d). последовательно справа налево вычисляются 1 +1/3 + 1/5 + ... + 1/9999 и 1/2 + 1/4 + ... + 1/10000, затем второе значение вычитается из первого.
#include <stdio.h>
int main(){
  double t,r,sum,sum1;
  for (int i=9999; i>=1; i=i-2)
    {
      t=1/i;
      sum+=t;
    }
  for (int i=10000; i>=2; i=i-2)
    {
      r=1/i;
      sum1+=r; 
    }
printf("%f",sum1-sum);
}
